color_range = {
    'yellow_door':[(34 , 37 , 126), (47 , 93 , 255)],#yw:起点和终点门上的黄色
    'black_door': [(45 , 26 , 15), (97 , 134 , 100)],#yw:起点和终点门上的黑色

    # 'blue_baf':[(100 , 127 , 56), (112 , 197 , 158)],#yw:挡板的蓝色
    'black_dir':[(81 , 65 , 25), (90 , 104 , 54)],     #yw:地雷的黑色
    'green_hole_chest':[(67 , 140 , 39), (76 , 255 , 104)],#yw:过坑的绿色（胸部检测）
    'green_hole_head':[(67 , 140 , 39), (76 , 255 , 104)],#yw:过坑的绿色（头部检测)
    # 'blue_hole_chest':[(102 , 123 , 132), (110 , 213 , 235)],#yw:过坑的蓝色（胸部检测）
    # 'blue_hole_head':[(102 , 123 , 132), (110 , 213 , 235)],#yw:过坑的蓝色（头部检测）
    # 'gray_white':[(54 , 31 , 79), (80 , 90 , 166)],#yw:这个没有用到，不用管

    'blue_floor':[(100 , 185 , 155), (105 , 234 , 229)],#yw:蓝色台阶
    'green_floor':[(69 , 155 , 86), (75 , 214 , 155)],#yw:绿色台阶
    'red_floor1':[(0, 153 , 142), (2 , 206 , 221)],#yw:红色台阶   我们取红色台阶需要有两个值
    'red_floor2':[(177 , 153 , 142), (179 , 206 , 221)],

    # 'red_XP1':[(0 , 104 , 126), (3 , 177 , 188)],#yw:红色下坡   他这里取了两个掩模做了或运算  不过这两个掩模的值怎么来的我不清楚。
    # 'red_XP2':[(173 , 98 , 111), (179 , 188 , 193)],

    # 'color11':[(104 , 141 , 154), (109 , 211 , 231)],#yw:这里和上面的台阶识别参数应该是一样的，不过为啥他要搞两个？区别不大
    # 'color22':[(63 , 73 , 88), (83 , 174 , 197)],
    # 'color33':[(0 , 86 , 135), (10 , 163 , 242)],

    'kick_ball_rec': [(45 , 2 , 246), (135 , 7 , 248)],  # yw：踢的白球
    'd_red_ball_floor1':[(177 , 99 , 129), (179 , 134 , 143)],#yw:这个和下面这个应该是砖
    'd_red_ball_floor2':[(75 , 18 , 182), (90 , 36 , 206)],
    # 'ball_red':[(30 , 3, 143), (173 , 44 , 237)],#yw:这个东西他们后面注释掉了，不用弄。
    'blue_hole': [(112 , 154 , 166), (115 , 177 , 181)],#yw:踢球洞的蓝色圈
    # 'red_floor':[(0 , 55 , 49), (179 , 146 , 134)],#yw：重复定义red_floor
    # 'head_blue_door':[(93 , 95 , 62), (113 , 197 , 197)],
    'green_bridge':[(69 , 116 , 115), (79 , 212 , 176)],#yw:绿色桥
    # 'blue_bridge':[(102 , 123 , 132), (110 , 213 , 235)],#yw:蓝色桥

    # 'green_bridge_rec':[(59 , 81 , 105), (67 , 153 , 144)],
    # 'blue_bridge_rec':[(102 , 123 , 132), (110 , 213 , 235)],

    'gray_dir':[(78 , 39 , 112), (83 , 54 , 166)],#yw：地雷关卡地板的灰色